Microchip-MPLAB-Harmony/net/apps/snmpv3_sdcard_fatfs/firmware/src/packs/ATSAME70Q19B_DFP/component/spi.h
/* -------- SPI_WPSR : (SPI Offset: 0xE8) (R/  32) Write Protection Status Register -------- */
#define SPI_WPSR_WPVS_Pos                     (0U)                                           /**< (SPI_WPSR) Write Protection Violation Status Position */
#define SPI_WPSR_WPVS_Msk                     (0x1U << SPI_WPSR_WPVS_Pos)                    /**< (SPI_WPSR) Write Protection Violation Status Mask */
#define SPI_WPSR_WPVS(value)                  (SPI_WPSR_WPVS_Msk & ((value) << SPI_WPSR_WPVS_Pos))
#define SPI_WPSR_WPVSRC_Pos                   (8U)                                           /**< (SPI_WPSR) Write Protection Violation Source Position */
#define SPI_WPSR_WPVSRC_Msk                   (0xFFU << SPI_WPSR_WPVSRC_Pos)                 /**< (SPI_WPSR) Write Protection Violation Source Mask */
#define SPI_WPSR_WPVSRC(value)                (SPI_WPSR_WPVSRC_Msk & ((value) << SPI_WPSR_WPVSRC_Pos))
#define SPI_WPSR_Msk                          (0x0000FF01UL)                                 /**< (SPI_WPSR) Register Mask  */

/** \brief SPI register offsets definitions */
#define SPI_CR_OFFSET                  (0x00)         /**< (SPI_CR) Control Register Offset */
#define SPI_MR_OFFSET                  (0x04)         /**< (SPI_MR) Mode Register Offset */
#define SPI_RDR_OFFSET                 (0x08)         /**< (SPI_RDR) Receive Data Register Offset */
#define SPI_TDR_OFFSET                 (0x0C)         /**< (SPI_TDR) Transmit Data Register Offset */
#define SPI_SR_OFFSET                  (0x10)         /**< (SPI_SR) Status Register Offset */
#define SPI_IER_OFFSET                 (0x14)         /**< (SPI_IER) Interrupt Enable Register Offset */
#define SPI_IDR_OFFSET                 (0x18)         /**< (SPI_IDR) Interrupt Disable Register Offset */
#define SPI_IMR_OFFSET                 (0x1C)         /**< (SPI_IMR) Interrupt Mask Register Offset */
#define SPI_CSR_OFFSET                 (0x30)         /**< (SPI_CSR) Chip Select Register Offset */
#define SPI_WPMR_OFFSET                (0xE4)         /**< (SPI_WPMR) Write Protection Mode Register Offset */
#define SPI_WPSR_OFFSET                (0xE8)         /**< (SPI_WPSR) Write Protection Status Register Offset */

/** \brief SPI register API structure */
typedef struct
{
  __O   uint32_t                       SPI_CR;          /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       SPI_MR;          /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   uint32_t                       SPI_RDR;         /**< Offset: 0x08 (R/   32) Receive Data Register */
  __O   uint32_t                       SPI_TDR;         /**< Offset: 0x0c ( /W  32) Transmit Data Register */
  __I   uint32_t                       SPI_SR;          /**< Offset: 0x10 (R/   32) Status Register */
  __O   uint32_t                       SPI_IER;         /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       SPI_IDR;         /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       SPI_IMR;         /**< Offset: 0x1c (R/   32) Interrupt Mask Register */
  __I   uint8_t                        Reserved1[0x10];
  __IO  uint32_t                       SPI_CSR[4];      /**< Offset: 0x30 (R/W  32) Chip Select Register */
  __I   uint8_t                        Reserved2[0xA4];
  __IO  uint32_t                       SPI_WPMR;        /**< Offset: 0xe4 (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       SPI_WPSR;        /**< Offset: 0xe8 (R/   32) Write Protection Status Register */
} spi_registers_t;
/** @}  end of Serial Peripheral Interface */

#endif /* SAME_SAME70_SPI_MODULE_H */

